Tested deploying changes to anvildev:

```
Terraform will perform the following actions:

  # aws_iam_account_password_policy.cis will be created
  + resource "aws_iam_account_password_policy" "cis" {
      + allow_users_to_change_password = true
      + expire_passwords               = (known after apply)
      + hard_expiry                    = (known after apply)
      + id                             = (known after apply)
      + max_password_age               = 90
      + minimum_password_length        = 14
      + password_reuse_prevention      = 24
      + require_lowercase_characters   = true
      + require_numbers                = true
      + require_symbols                = true
      + require_uppercase_characters   = true
    }
```

![Screen Shot 2022-12-13 at 9 42 56 AM](https://user-images.githubusercontent.com/46407464/207406484-0ad994f0-c30a-47b9-8577-76f3fcb2e128.png)
